OdDAI.Model.entityInstancesCount
\details
Retrieves the count of all entity instances in this model.
\returns An integer that contains the count of all entity instances.

OdDAI.Model.deleteInstance(OdDAI.ApplicationInstance*)
\details
Deletes a specified entity instance from the model.
\param pInstance [in] A raw pointer to the entity instance to be deleted.
\remarks
When the method is called the specified instance is marked as deleted, but it still stays in the model.
The deleted instance is not written to the file.
During the next file reading operation, the instance will not be read from the file
therefore it will be physically removed from the model.

OdDAI.Model.insertEntityInstance(OdSmartPtr&lt;OdDAI.ApplicationInstance&gt;,OdDbHandle!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Inserts a newly created entity instance to the model.
\param pInstanceToInsert [in] A smart pointer to the entity instance to be inserted.
\param insertHandle      [in] A handle of the parent object where to insert the entity instance.
\returns An identifier of the inserted entity instance.
\remarks
If the entity being inserted already belongs to another model or it has been already appended or inserted before, the method returns a NULL object identifier.
If the specified database handle already exists in the model, the entity defined with this handle gets a new handle value
and the inserted entity (specified with the pInstanceToInsert parameter) takes the passed handle value (the insertHandle parameter value).

OdDAI.Model.createEntityInstance(OdDAI.Entity!System.Runtime.CompilerServices.IsConst*)
\details
Creates a new instance of a specified entity type.
\param entityDef [in] A raw pointer to the entity definition that contains the type name of the new entity to be created.
\returns A smart pointer to the created entity instance.
\remarks
If the current schema does not support the specified type, the method returns a NULL smart pointer.
In this case, the isNull() method of the smart pointer object returns true.
The created entity is not attached to the model.